[
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post critics and provides alternative graphical presentation on a data visualisation from an extract of the annual report on Singapore’s labour market by Ministry of Manpower. The datasets taken are Table 5 and table 7 from https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx",
    "author": [
      {
        "name": "Mei Siew Toh",
        "url": "https://www.linkedin.com/in/mei-siew-toh/"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nThis post is focusing on Chart 6 - Resident Labour Force by age per cent from Report: Labour Force in Singapore 2019. The tasks for this DataViz Makeover are as followed:\r\nCritic the graph on its clarity and aesthetics\r\nSuggest alternative graphical presentation to improve and provide a proposed design\r\nDesign proposed data visualization using Tableau\r\nProvide Step-by-Step description of data visualization preparation\r\nDescribe three major observations\r\n2.0 Critics\r\n2.1 Clarity\r\nFirstly, the title of the chart is misleading. The words “Resident Labour Force by Age” are in bold whereas the words “per cent” are represented with a smaller font. At first glance, readers may assume that the visualization portrays the number of resident labour force by age in either thousands or million, instead of the percentage of resident labour force (RLF) by age bands.\r\nThis visualization shows percentage of RLF by age band of 5 years intervals. To derive the following insight “the share of RLF aged 25-54 declined from 75% to 67%”, readers must manually sum up the values in the tables. There is no data supporting the claim in the increase in Labour Force Participation Rate (LFPR) of older residents.\r\nReaders are not able to derive the median age based on the visualization, apart from the 2 annotations on median age. The values plotted in the visualization are percentage of labour force by each age-band. To find the 50th percentile, readers must manually add up the values in the table to find the median age.\r\nLastly, by representing RLF by age in percentages, readers do not have any insights on the absolute size of labour force for each age band in 2019 and 2009. It is difficult to observe how population cohorts move across age bands. Hence, it is not possible to derive the following 2 statements from the visualization:\r\nShare of resident aged 55 and above rose partially due to population ageing\r\nDecrease in percentage of RLF of age band 25-29 due to lower birth rates.\r\n2.2 Aesthetics\r\nThere is no proper labeling of both axis for the line graph. Other than the name of the chart “Resident labour force by age per cent”, there is no indication of what the values on the y-axis represents. Units are not indicated in the table. This might confuse readers into thinking that it represents the RLF in millions or thousands.\r\nThe color used for both the x-axis (age band) and the trend line for June 2009 are both grey. There is no visual contrast.\r\nAs there is no clear legend, there are multiple annotations on the visualization, including the labeling of the 2 trend lines for 2009 and 2019 and the 2 reference lines indicating the median age. This makes the visualization cluttered and wordy.\r\n3.0 Alternative Graphical Representation\r\nThe current data visualization lacks details on LFPR as well as the absolute number of labour force for the population cohorts.Hence, the proposed design comprises 4 data visualizations, in order to provide the 4 key insights in the statement.\r\n\r\n\r\n\r\nDataViz 1 shows the percentage of resident labour force for 3 key age-bands, namely 15-24, 25-54 and 55 and above. The use of stacked bar graph will allow readers to visualize the share of RLF in both 2009 and 2019. DataViz 2 shows the LFPR of 2009 and 2019 across age-bands. DataViz 3 show the cohort size of each age band, and how population cohorts move across age-bands. Lastly, DataViz 4 shows the cumulative total of RLF in percentage. By plotting the 50-percentile reference line, it shows the increase in median age in 2019.\r\nThe proposed data visualization is designed using Tableau and can be found here\r\n4.0 Data Visualization Preparation\r\n4.1 Data Preparation\r\nFor DataViz 1, 3 and 4\r\nThe dataset used is from Table 7 RESIDENT LABOUR FORCE AGED FIFTEEN YEARS AND OVER BY AGE AND SEX, 2009 - 2019 (JUNE), the excel sheet in Tab – T7_T. The data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx.\r\nIn this excel sheet, column E and Z correspond to the data in Year 2009 and 2019. The remaining columns are removed as they are not required. Row 6 shows the total resident labour force for each year, and deleted, since Tableau has calculated field functions to generate the required data.\r\n\r\n\r\n\r\nThe revised datasheet is imported into Tableau for further data visualization preparation. The categorical variable – Age(Years) occupies 3 columns (A,B,C) and hence Column A and B contains null values. These 3 columns are selected and “Merge Mismatch Fields” is selected. The column is renamed to “Age (Years)”. All 3 variables and their respective data types are mapped accurately by Tableau.\r\n\r\n\r\n\r\nFor DataViz 2\r\nThe dataset used is from Table 5 RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE), the excel sheet in Tab – T5_T. The data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx.\r\nIn this excel sheet, column E and Z correspond to the data in Year 2009 and 2019. The remaining columns are removed as they are not required. Row 6 and row 19 onwards are deleted as well.\r\n\r\n\r\n\r\nThe column 2009 and 2019 are renamed to 2009 (%) and 2019 (%) All 3 variables and their respective data types are mapped accurately by Tableau.\r\n\r\n\r\n\r\n4.2 Data Visualization Preparation\r\nData Visualization 1 - Percentage Share of Labour Force By Age Band\r\nCreating new calculated field\r\nTo find percentage share of RLF for each age band, 2 new calculated fields are created.\r\n\r\n\r\n\r\nGrouping of Dimensions\r\nInstead of showing 12 age-bands, the age-bands will be collapsed only 3 age-bands by using the grouping function.The final age-bands are 15 to 24, 25 to 54 and 55 and above. The new dimension is re-labeled as Age Band (Years), the 3 age bands are renamed and re-colored into 3 distinct colors.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFinal Layout\r\nThe visualization is given a proper header and the y-axis is fixed with the range 0% to 100%. The y-axis is also renamed as “Share of Resident (%)” The values are labeled by selecting “Show Mark labels” to provide readers more clarity on the values.\r\n\r\n\r\n\r\nData Visualization 2 - Labour Force Participant Rate by Age Band\r\nCreating a line graph\r\n[Age (Years)] are placed at the columns whereas [Measure Values], which include summation of LFPR in 2009 and 2019 are placed in the rows. 2009 is represented by blue whereas 2019 is represented by red. The marks are changed to line graph. The visualization is given a proper header. The y-axis is also renamed as “Labour Force Participation Rate (%)”\r\n\r\n\r\n\r\n\r\n\r\n\r\nData Visualization 3 - Cumulative Total of Resident Labour Force by Age\r\nCreating new calculated field\r\nTo find the cumulative total of residents in 2009 and 2019, 2 calculated fields are created using the following equation RUNNING_SUM(SUM([2009])) / TOTAL(SUM([2009]))\r\n\r\n\r\n\r\nFinal Layout\r\nThe 2 new fields are renamed as % of Cumulative Total 2009 and 2019 respectively. The 2 measure values are selected into the rows of the visualization, with 2009 represented by blue and 2019 represented by red. The mark is changed to line to show the gradient of the cumulative total.The visualization is given a proper header and the y-axis is fixed with the range 0% to 100%. The y-axis is also renamed as “Cumulative Total of Resident(%)”\r\n\r\n\r\n\r\nAdding Reference Line and Annotation\r\nTo show the median age of labour force in 2009 and 2019, a reference line at the 50 percentile is added. As the x-axis consists of age-band instead of age, annotations are included to provide more clarity\r\n\r\n\r\n\r\nData Visualization 4 - Resident Labour Force by Age\r\nCreating a Histogram\r\n[Age (Years)] and [Measure Names] are placed at the columns whereas [Measure Values], which include summation of number of residents in 2009 and 2019 are placed in the rows. Keeping the colors consistent, 2009 is represented by blue whereas 2019 is represented by red. The marks are changed to bar for easier comparison between age bands\r\n\r\n\r\n\r\nFinal Layout\r\nThe visualization is given a proper header. The y-axis is also renamed as “Number of Residents (‘000)”. Only the bars with a significant difference in values are being marked to avoid cluttering\r\n\r\n\r\n\r\n5.0 Major Observations\r\n1. Later retirement age\r\nIn 2009, residents aged 35-39 have the most number of residents in labour force whereas in 2019, residents aged 45-49. This is the same population cohort that moved across age-band after 10 years. Comparing the population cohorts between age 35 to 49 in 2009 and the population cohorts between age 45 to 59 in 2019, there is minimum reduction in residents per population cohort. This suggests this population cohort retire at a later age, as compared to 2009.\r\n2. Baby boomers - Spike in population aged 55 and above\r\nThere is a substantial increase in residents in labour force above age 55 due to 2 reasons:\r\nIncrease in RLFR as compared to 2009 as supported by 2nd visualization\r\nSpike in population, with baby boomers born between 1947 to 1964 who are aged 55 and above in 2019.\r\n3. Entering workforce at a later age\r\nIn 2009, the population cohort of 25-29 has the highest RLPR whereas in 2019, the population cohort of 30-34 has the highest RLPR instead. This implies that the average age to enter workforce in Singapore has increased, probably due to additional years of education.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T01:44:04+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-07-my-first-post/",
    "title": "My First Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Mei Siew Toh",
        "url": "https://www.linkedin.com/in/mei-siew-toh/"
      }
    ],
    "date": "2021-01-07",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-07-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-07T23:32:15+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to VIZ",
    "description": "Welcome to our new blog, VIZ. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Mei Siew Toh",
        "url": "https://www.linkedin.com/in/mei-siew-toh/"
      }
    ],
    "date": "2021-01-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-07T22:56:34+08:00",
    "input_file": {}
  }
]
