[
  {
    "path": "posts/2021-01-07-my-first-post/",
    "title": "My First R Markdown Document",
    "description": "A new article created using the Distill format.",
    "author": [
      {
        "name": "Dr. Kam Tin Seong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-28",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix. There are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-07-my-first-post/distill-preview.png",
    "last_modified": "2021-02-28T21:36:09+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-28-proposal/",
    "title": "Project Proposal",
    "description": "The Prime Crime Area Spatio-Temporal Analysis",
    "author": [
      {
        "name": "GABRIELLA PAULINE DJOJOSAPUTRO",
        "url": {}
      },
      {
        "name": "TAN HUIYONG",
        "url": {}
      },
      {
        "name": "TOH MEI SIEW",
        "url": {}
      }
    ],
    "date": "2021-02-28",
    "categories": [],
    "contents": "\r\nContents\r\nExecutive Summary\r\nMotivation\r\nProject Objectives\r\nDatasets\r\nProposed Scope and Methodology\r\nStoryboard & Visualization Features\r\nSoftware Tools\r\nR-Packages\r\nReferences\r\nExecutive Summary\r\nBack to top\r\nDemographic, socio-economic and crime rate data of the Greater London Region, retrieved from the London Datastore, are used in this project. In this project, 3 key analysis will be performed:\r\nExploratory Data Analysis\r\nClustering analysis\r\nRegression Modeling \r\nMotivation\r\nBack to top\r\nWith the limited police resources and possible adverse impact when crime occurs, analytics on crime has been done as far back as in the 1800s (Hunt, 2019). Crime occurrence was found to have spatial patterns, and thus predictive analytics should be possible. However, mixed results were obtained in the research to determine whether predictive policing results to lower crime rates (Meijer & Wessels, 2019). Thus, it is more beneficial to use the analytics to determine areas with higher risk of crime and to discover the underlying factors to the increased risk.\r\nTraditionally, crime analysis is done manually or through a spreadsheet program (RAND Corporation, 2013). This project would give the users an easier way to do the analysis using a web application.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-28T22:31:45+08:00",
    "input_file": "proposal.utf8.md"
  },
  {
    "path": "posts/2021-02-17-dataviz-makeoever-2/",
    "title": "Dataviz Makeover 2",
    "description": "This post critics and provides alternative graphical presentation by using data from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github. The datasets are taken from https://github.com/YouGov-Data/covid-19-tracker",
    "author": [
      {
        "name": "Mei Siew Toh",
        "url": "https://www.linkedin.com/in/mei-siew-toh/"
      }
    ],
    "date": "2021-02-17",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nThis post is focusing on the 2 data visualization found in DataViz Makeover 2 for ISSS608 Visual Analytics and Applications. The tasks for this DataViz Makeover are as followed:\r\nCritic the graph on its clarity and aesthetics\r\nSuggest alternative graphical presentation to improve and provide a proposed design\r\nDesign proposed data visualization using Tableau\r\nProvide Step-by-Step description of data visualization preparation\r\nDescribe three major observations\r\nThe original data visualizations are as seen below:\r\n\r\n\r\n\r\n2.0 Critics\r\n2.1 Clarity\r\nMisleading Title based on only 1 survey question\r\nThe data used in the 1st bar chart (DataViz1) “Which country is more pro-vaccine?” is retrieved from the responses in the survey question –vac-1: “If a Covid-19 vaccine were made available to me this week, I would definitely get it”. The title is misleading, as this survey question only is unable to determine if a country is more “pro-vaccine” than others.\r\nIn addition, in the 2nd bar chart(DataViz2), the title is misleading as users will assume that the survey question is “I would definitely get a vaccination” and fail to consider the context – “available to me this week”\r\nLimitation in Survey Question\r\nThis visualization also failed to consider changes in responses week on week, as the time frame mentioned in survey question is limited “this week”. Given that updates and news on COVID-19 happen rapidly daily, survey responses can change over weeks. The graph is unable to show any trend in responses throughout the 4 weeks in January.\r\nMissing data representation of uncertainty\r\nDataViz2 “% of strongly agreed to vaccination” is redundant as it is a filtered version of Graph 1, showing only the percentage of population who strongly agree to survey question vac-1.Apart from arranging the countries via the country with the highest percentage of strongly agree, it does not provide any additional insights. As there can be different number of survey records per country, it does not show any error bar constructed with confidence interval. Overall, it lacks the additional input to showcase the level of uncertainty.\r\nMissing timeframe in data visualization\r\nThe survey is done across 29 countries, with the addition of Israel in 2021. In both DataViz1 and DataViz2, only 14 countries are shortlisted and represented in the data visualization. There is no write-up or annotation to explain the reason to exclude the other 15 countries. In addition, the survey collects results weekly from 31st March 2020 to date from 2020 to 2021 and it is uncertain which time frame the visualization is based off. It was only then mentioned in the writeup that the research is based off the survey results in Jan 2021.\r\nLack of demographic details\r\nLastly, there is no demographics details to further breakdown the responses. Users can only compare results across countries but unable to compare any plausible relationship between response and attributes such as gender, age, household size.\r\nArrangement of Countries\r\nCountries in DataViz1 are arranged based on alphabetical order. In the current stacked bar chart visualization, this arrangement does not bring any additional value to the users. It is hard to find the country with the highest percentage of “Strongly disagree” without scanning through the entire graph. The sorting of countries in Graph 2 is based descending order of percentage values, bringing users ‘attention to the top countries. However, it is time consuming for users to toggle between 2 graphs since the countries are arranged differently. The arrangement of both charts should be standardized.\r\n2.2 Aesthetics\r\nChoice of Color\r\nFirstly, the scale of 1 to 5 is represented by 5 different colors that are not intuitive for readers. For example, a response of “3” is neutral but represented by the color – red which typically inferred as negative. Users are required to refer to the legend, making it cumbersome to analyze the data visualization.\r\nStacked Bar Chart\r\nDataViz1 is represented by a stacked bar chart to show the distribution across the 5 response. The stacked bars are all plotted from the same reference line starting from 0%. Even though users can see the weightage of each response, they are unable to compare the weightage of positive and negative responses right away. The chart itself lacks a standardized divergent point to visually interpret the distribution of positive (agreement), negative (disagreement) and neutral responses.\r\nAxis and Grids\r\nThe vertical axis header “Country” is aligned on the right for DataViz1 but aligned to the left for DataViz2, showing inconsistencies. Both the headers “Country” and “% Strongly Agree” have the “Sort” symbol. At first look, users might think that the countries are sorted by alphabetical order. The value labels of the x-axis for DataViz2 has decimal places, which are redundant. In addition, the axis stops at 60%, whereas united kingdom has a value more than 60%, making the data visualization ugly and cluttered. There is no proper boundary between the legend and the visualization.\r\n3.0 Alternative Graphical Representation\r\n3.1 Suggested Improvements\r\nAdditional Survey Questions (Issues to Tackle: Misleading Title, Limitation in survey question)\r\nTo include results of additional survey questions, with the questions as a filter\r\nTitle will be referencing to the survey question instead of “Which country is more pro-vaccine?”\r\nError Bar on Dot Plot (Issues to Tackle: Missing data representation of uncertainty)\r\nTo change DataViz2 into error bar constructed using a confident interval determined by user.\r\nIncluding Time Frame (Issues to Tackle: Missing timeframe in data visualization)\r\nTo include time frame as a filter\r\nAs different countries started the survey on different weeks, the date will be used as a filter instead of week number\r\nTo add an additional visualization not show the entirety of the data, to show the trend of responses over weeks.\r\nAdding Demographics Breakdown (Issues to Tackle: Lack of demographic details)\r\nTo add an additional parameter – Demographics into tool tip\r\nTool tip will be dynamic based on selection, with the option to breakdown into gender, age, household size, household children and employment status.\r\nConsistency in Both Data Visualization (Issues to Tackle: Arrangement of Countries, Axis and Grids)\r\nTo keep arrangement of countries consistent by using alphabetical order for ease of comparison.\r\nTo keep header alignment and axis values decimal points consistent.\r\nTo space out the bars in DataViz1 and to remove “Sort” symbol in DataViz2\r\nBuilding a Likert Chart (Issues to Tackle: Color, Stacked Bar Chart)\r\nTo change DataViz1 to a Likert Chart with the following color scale\r\n5- strongly disagree as dark red, 4 – disagree at red, 3 – Neutral as grey, 2 – Agree as blue, 1 – Strongly Agree as Dark Blue\r\n3.2 Alternative Graphical Representation\r\nThe draft for DataViz Makeover can be seen below, where the 2 key visualizations are i) a Likert Graph and ii) An Error Bar with dot plot.\r\n\r\n\r\n\r\nThe proposed data visualization is designed using Tableau and can be found here\r\n4.0 Data Visualization Preparation\r\n4.1 Data Preparation\r\nThe dataset used is obtained from Imperial College London YouGov Covid 19 Behavior Tracker Data Hub hosted at Github. The data is available at https://github.com/YouGov-Data/covid-19-tracker. A total of 29 datasets is extracted, with each dataset representing 1 country. Israel will not be part of the data preparation as it only has 1 week of data.\r\nUsing “Get Data “function in excel, all the 29 datasets are merged into a single CSV file\r\n\r\n\r\n\r\nA new column is created, containing the source of the data.\r\n\r\n\r\n\r\nThe 1st column is renamed as “Country” and for all values under column A, “.csv” is removed. Using the new dataset, the columns selected are time of survey (endtime), demographics details: Household_Children, Age, Gender, Household size, employment_status) and survey results (vac_1, vac_2,vac2_1, vac2_2, vace2_4, vac2_6 and vac3). Only 2021 survey results are filtered and retained. Endtime is reformatted to follow the following format – MM/DD/YYYY. With these filters applied in this dataset, there are only 15 countries remaining for further exploration.\r\n\r\n\r\n\r\nThe revised datasheet is imported into Tableau for further data visualization preparation\r\n4.2 Data Visualization Preparation\r\nThe data type for each column is selected correctly on Tableau.\r\n\r\n\r\n\r\nThe columns representing survey questions are renamed for better references. - Vac_1 : If a Covid-19 vaccine were made available to me this week, I would definitely get it: - Vac_2_1: I am worried about getting COVID19 - Vac_2_2: I am worried about potential side effects of a COVID19 vaccine - Vac_2_3: I believe government health authorities in my country will provide me with an effective COVID19 vaccine - Vac_2_6: If I do not get a COVID19 vaccine when it is available, I will regret it - Vac_3: If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it\r\nUsing the pivot function, the dataset is transformed, with 2 new pivot field columns representing survey questions and responses.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe 2 pivot fields are renamed as “Survey Questions” and “Response”\r\n\r\n\r\n\r\nFor the column [Response], a new calculated field [Score] is created to only take into account the numerical value of the responses – i.e “1-Strongly agree” to be “1”.\r\n\r\n\r\n\r\nThe dataset is now ready to be used for data visualization.\r\n4.3 Creating a Likert Chart\r\nAs mentioned in section 2 and 3, the current stacked bar chart is plotted from the same reference line and is missing a standardized divergent point to show the polarity of the responses - agreement and disagreement. Hence, a Likert chart will be more suitable to show the distribution of responses through a standardized starting point.\r\nCreation of Calculated Fields\r\nBefore creating a likert chart, there are some calculated fields to be created.\r\nNumber of Records: 1\r\nTotal Count = TOTAL(sum([Number of Records]))\r\nPercentage = SUM([Number of Records])/[Total Count]\r\nCount Negative =\r\n\r\nIF  [Score]>3 then 1\r\nELSEIF [Score]= 3 THEN 0.5\r\nELSE 0\r\nEND\r\n\r\nTotal Count Negative = Total(sum([Count Negative]))\r\nGantt Start = -[Total Count Negative]/[Total Count]\r\nGantt Percent = PREVIOUS_VALUE([Gantt Start])+ZN(LOOKUP([Percentage],-1))\r\nPlotting a Likert Chart\r\n[Gantt Percent] is placed on the Columns shelf and [Survey questions] is placed on the rows shelf. [Score] is dragged onto color and detail to break down the Gantt Percent values via [score] and to differentiate the different scores by colors. [Percentage] is dragged to size and [Gantt Bar] is selected as the mark type. Lastly, [Gantt Percent] is computed using score.\r\n\r\n\r\n\r\n\r\n\r\n\r\nAesthetic Adjustments\r\nThere are responses that are “null” as the survey questions may not be applicable to certain countries. The “Null” score is excluded in the data visualization.\r\n\r\n\r\n\r\nThe color scale is revised to be more intuitive, with the color scale mentioned in Section 3.\r\n\r\n\r\n\r\nA reference line of value “0” is added, to show the divergent point of responses using the mid point of neutral responses.\r\n\r\n\r\n\r\nAliases are added to extreme scores of 1 and 5 to show the value of the scores, with 1 as 1- Strongly Agree and 2- Strong Disagree\r\n\r\n\r\n\r\nFor the x-axis, [Gantt Percent] is renamed to Percentage and the values on the scale are represented in percentages instead of decimal\r\nAfter ensuring the Likert graph is plotted accurately, [Survey Question] is replaced by [Country] in the rows section and [Survey Question] is placed as a filter.\r\n\r\n\r\n\r\nFinal Touches\r\n[Survey Question] is also included dynamically as the title of the data visualization to provide more clarity to users.. Date is placed as a filter, with the range of dates limited to a week from 1st Jan to 7th Jan.\r\n\r\n\r\n\r\nBoth the survey question and date filters are exposed to users.\r\n\r\n\r\n\r\nLastly, animation is added in to see how responses change between different survey questions.\r\n\r\n\r\n\r\n4.4 Creating a Trend Graph\r\nThe Likert Chart is duplicated into a new sheet and revised to plot a trend graph.\r\nPlotting a Line Graph\r\nInstead of using [Gantt Percent], [Percentage] is placed in the row shelf, computed using [Score]. [Date] is placed in the column shelf, showing the actual day.\r\n\r\n\r\n\r\nThe Mark type is set to “Line”, [Score] is removed from detail and [Percentage] is removed from size.\r\n\r\n\r\n\r\nBased on the trend graph, users are able to spot any spikes in extreme responses in the month of January\r\n\r\n\r\n\r\nThe survey question filter is removed for this data visualization.\r\n4.5 Creating Demographic Breakdown Via Bar Chart\r\nTo provide more on-demand parameters that allow users to breakdown the results, a bar graph is plotted in a new worksheet.\r\nReviewing Demographic Data\r\nThe demographic data points shortlisted are\r\nAge\r\nGender\r\nHousehold Children\r\nHousehold Size\r\nFor “Age”, the value ranges from 18 to 99 and hence, having 82 values for this dimension is not practical. Hence, using the “Create Group” function, a new dimension – Age (group) is created and the ages are grouped into the following: 18-24, 25-34, 35-44, 45-54, 55-64 and 65 & Above.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFor Household Children, the values of this dimension do not match the actual number of children in the household Based on the codebook, the label “1” , represents 0 children, and label “8” represents “Prefer not to say”. A quick pivot table on the dataset will show values “0” and “7”that are not present in the codebook. To avoid confusion, the values of this dimension can be re-adjusted to reflect the exact number of children.\r\n\r\n\r\n\r\n\r\n\r\n\r\nHowever, it will be hard to determine whether the response refers to the number of children, or the labels, which represent a different value. As such, household children will not be part of the break down.\r\nLastly, for household size, the label and the value matches.\r\n\r\n\r\n\r\nFor survey responses with value “8”, they are group with “8 or more’”.\r\n\r\n\r\n\r\nThe new dimension is saved as “Household Number of Pax”\r\n\r\n\r\n\r\nThe 3 demographics – Age(Group), Gender and Household Number of Pax are all in the dimension data form.\r\nCreation of Parameter- Demographic Data\r\nA new parameter – Demographic Data is created, with a list of values that match the 3 dimensions.\r\n\r\n\r\n\r\nCreation of Calculated field – Demographic\r\nA new calculated field – Demographic is created, with the following formula\r\n\r\nCASE [Demographic Data]\r\nWHEN \"Gender\" THEN [Gender]\r\nWHEN \"Household Number of Pax\" THEN [Household Number of Pax]\r\nWHEN \"Age (group)\" THEN [Age (group)]\r\nEND\r\n\r\n\r\n\r\n\r\nPlotting Demographic Breakdown Via A Bar Chart\r\n[Demographic] is placed on the Columns shelf and [Percentage] is placed on the rows shelf. The paramter – [Demographic Data] is exposed.\r\n\r\n\r\n\r\nAesthetic Adjustments on Bar Graph\r\nThe header of the columns is hidden and the title of the visualization is based on the demographic data selected.\r\n\r\n\r\n\r\nThe axis is changed to represent percentages instead\r\n\r\n\r\n\r\n4.6 Creating An Error Bar on a Dot Plot\r\nFor this data visualization, it is focusing on percentage of people who responded to “Strongly Agree” . As such, the error plot is working with confidence interval of a percentage, chosen by the user.\r\nCreation of Parameter- Confidence Level\r\nA new parameter – Confidence Level is created. The most common confidence levels are\r\n99%\r\n95%\r\n90%\r\nFor each confidence level, the Z-score of each confidence level is recorded as Value and display as “Confidence Level”\r\n\r\n\r\n\r\nCreation of Calculated Fields\r\nBefore creating the error bar, there are some calculated fields to be created. 1. Count SA\r\n\r\nIF  [Score] = 1 THEN 1 \r\nELSE 0\r\nEND\r\n\r\nProp = SUM([Count SA])/SUM([Number of Records])\r\nProp_SE = SQRT(([Prop]*(1-[Prop]))/SUM([Number of Records]))\r\nProp_Upper Limit = [Prop]+[ConfidenceLevel]*[Prop_SE]\r\nProp_Lower Limit = [Prop]-[ConfidenceLevel]*[Prop_SE]\r\nPlotting an Error Bar on Dot Plot\r\n[Prop] and [Mesure Values] are placed on the Columns shelf and [Country] is placed on the rows shelf. In [Measure Values], all the values are removed, with only [Prop_Lower Limit] and [Prop_Upper Limit] remaining.\r\n\r\n\r\n\r\nThe 2 visualisations are combined by selecting Dual Axis.\r\n\r\n\r\n\r\nThe axis are synchronized as well\r\n\r\n\r\n\r\nAesthetic Adjustments on Error Bar\r\nFor [AGG(Prop)], the mark type is changed to circle, whereas for [Measure Values], the mark type is changed to line. [Measure Names] is dragged onto detail.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe parameter [Confidence Level] is exposed. The top header is also removed.\r\n\r\n\r\n\r\nFor the x-axis, [Prop] is renamed to Percentage and the values on the scale are represented in percentages instead of decimal\r\n\r\n\r\n\r\n5.0 Tableau Dashboard Creation\r\n5.1 Creation of Zoom-in Function\r\nTo stich the likert chart, error bar and the time-series together, additional reference bands are added into the time-series chart. The time-series visualisation will serve as a slider that filter data based on the date range selected.\r\nCreation of Parameters\r\nThe following parameters are created\r\nDate Slider: the entire January date range is selected, with step size of 1 day\r\n\r\n\r\n\r\nDays: To create the range of days user will want to select. Currently, as the data used is only January, only 2 options- 7 days (1 week) and 31 days (Entire month) are created.\r\n\r\n\r\n\r\nCreation of Calculated fields\r\nThe start date selected on the slider will be placed at the start of the highlighted data.The two calculated fields mark the boundary of the date range selected.\r\nLower Zoom Date: DATE(DATEADD(‘day’,0,[Date Slider]))\r\nUpper Zoom Date: DATE(DATEADD(‘day’,CEILING([Days]-1),[Date Slider]))\r\nFor both the Likert Graph and the error bar to show data filtered via the date slider, 2 binary calculated fields are created\r\nDATE([Date])>=[Lower zoom date]\r\nDATE([Date])<=[Upper zoom date]\r\nThese 2 fields are pulled into Filters, with the “True” condition\r\n\r\n\r\n\r\n\r\n\r\n\r\nCreation of Reference Line\r\nLastly, 2 reference bands are used to block out any dates that are not selected. For the first reference band, it is to block out the dates prior to the selected date range. [Lower Zoom Date] is selected as the maximum whereas [Date] is selected as the minimum.\r\n\r\n\r\n\r\nFor the second reference band, it blocks out the dates later than the selected date range. [Upper Zoom Date] is selected as the minimum whereas [Date] is selected as the maximum.\r\n\r\n\r\n\r\nThe 2 parameters are exposed in the trend graph.\r\n\r\n\r\n\r\n5.2 Creation of Tool-tip on Likert Graph\r\nGoing to the Likert Chart worksheet, selecting “Tooltip”, the [Demographic Data] parameter is selected, as well as the Demographic Worksheet. The parameter will serve as the header, hence centralized and in bold.\r\n\r\n\r\n\r\nBy hovering over the selected responses, a user can understand the demographic breakdown of the respondents\r\n\r\n\r\n\r\n5.3 Creation of Dashboard\r\nFirstly, both the Likert Graph and trend graph are selected and pulled into the dashboard. For the filter – [Survey Questions], the filter is applied to all using related data sources.\r\n\r\n\r\n\r\nThe date slider of the trend graph is moved to the bottom of the trend graph. The title is also hidden for aesthetic purposes. The title of the trend grpah is hidden and the graph is resized so that it sits nicely at the bottom of the dashboard.\r\n\r\n\r\n\r\nThe uncertainty graph is added on the right of the Likert Chart.\r\n\r\n\r\n\r\nThe title for the error bar is renamed to include the confidence level selected by the user and the title of the Likert Graph is also renamed for more clarity.\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe Paramter [Days] are moved to be next to the slider, and renamed as “Duration (Days)” for more clarity. Header is added for this data visualization to provide more context.\r\n\r\n\r\n\r\nLastly, borders and colors are added to ensure that the filter option for [Survey Questions] are easily seen by the user. The parameters – [Confidence Level] [Demographic Data] and [Duration (Days)] are added borders and shaded to show more visibility\r\n\r\n\r\n\r\n6.0 Major Observations\r\nPercentage of People Who are Open to Getting a Vaccine\r\nBy toggling between 2 questions, people are more open to getting the vaccine after 1 year, instead of this week. Overall, the percentage of people who are highly agreeable are higher. Countries such as Australia and France show a higher percentage of people who are open to getting the vaccine in the long term but not in the short term.\r\n\r\n\r\n\r\n\r\n\r\n\r\nA spike in positive sentiments towards the vaccine\r\nWith the time slider, the user is able to see how data changes over the weeks. For the week of 9th Jan, there is a spike in percentage of strongly agreeable. This based on the Likert Graph, it is largely due to UK. This week is also the week in UK with the highest number of COVID cases. It is possible that people are more open to the vaccine due the heightened fear.\r\n\r\n\r\n\r\nDifferent sentiments across age group\r\nBy hovering over the bars on the Likert graph, the age distribution across the people who are highly agreeable to getting vaccine are 65 years and above. The openness of the elderly may be a result of a UK grandmother who is the first person in the world to be given the Pfizer Covid-19 jab as part of a mass vaccination programme. Article Link\r\n\r\n\r\n\r\nFor the younger age bands, they are neutral or highly disagreeable to getting a vaccine.\r\n\r\n\r\n\r\n\r\n\r\n\r\nDifference in Gender\r\nAmong all countries, on the question on “I am worried about getting COVID19”, females take up the higher proportion of respondents towards “Strongly Agree”. This is common across all the countries in the dataset, be it an Asian country or a European country.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T02:45:43+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post critics and provides alternative graphical presentation on a data visualisation from an extract of the annual report on Singapore’s labour market by Ministry of Manpower. The datasets taken are Table 5 and table 7 from https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx",
    "author": [
      {
        "name": "Mei Siew Toh",
        "url": "https://www.linkedin.com/in/mei-siew-toh/"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nThis post is focusing on Chart 6 - Resident Labour Force by age per cent from Report: Labour Force in Singapore 2019. The tasks for this DataViz Makeover are as followed:\r\nCritic the graph on its clarity and aesthetics\r\nSuggest alternative graphical presentation to improve and provide a proposed design\r\nDesign proposed data visualization using Tableau\r\nProvide Step-by-Step description of data visualization preparation\r\nDescribe three major observations\r\n2.0 Critics\r\n2.1 Clarity\r\nFirstly, the title of the chart is misleading. The words “Resident Labour Force by Age” are in bold whereas the words “per cent” are represented with a smaller font. At first glance, readers may assume that the visualization portrays the number of resident labour force by age in either thousands or million, instead of the percentage of resident labour force (RLF) by age bands.\r\nThis visualization shows percentage of RLF by age band of 5 years intervals. To derive the following insight “the share of RLF aged 25-54 declined from 75% to 67%”, readers must manually sum up the values in the tables. There is no data supporting the claim in the increase in Labour Force Participation Rate (LFPR) of older residents.\r\nReaders are not able to derive the median age based on the visualization, apart from the 2 annotations on median age. The values plotted in the visualization are percentage of labour force by each age-band. To find the 50th percentile, readers must manually add up the values in the table to find the median age.\r\nLastly, by representing RLF by age in percentages, readers do not have any insights on the absolute size of labour force for each age band in 2019 and 2009. It is difficult to observe how population cohorts move across age bands. Hence, it is not possible to derive the following 2 statements from the visualization:\r\nShare of resident aged 55 and above rose partially due to population ageing\r\nDecrease in percentage of RLF of age band 25-29 due to lower birth rates.\r\n2.2 Aesthetics\r\nThere is no proper labeling of both axis for the line graph. Other than the name of the chart “Resident labour force by age per cent”, there is no indication of what the values on the y-axis represents. Units are not indicated in the table. This might confuse readers into thinking that it represents the RLF in millions or thousands.\r\nThe color used for both the x-axis (age band) and the trend line for June 2009 are both grey. There is no visual contrast.\r\nAs there is no clear legend, there are multiple annotations on the visualization, including the labeling of the 2 trend lines for 2009 and 2019 and the 2 reference lines indicating the median age. This makes the visualization cluttered and wordy.\r\n3.0 Alternative Graphical Representation\r\nThe current data visualization lacks details on LFPR as well as the absolute number of labour force for the population cohorts.Hence, the proposed design comprises 4 data visualizations, in order to provide the 4 key insights in the statement.\r\n\r\n\r\n\r\nDataViz 1 shows the percentage of resident labour force for 3 key age-bands, namely 15-24, 25-54 and 55 and above. The use of stacked bar graph will allow readers to visualize the share of RLF in both 2009 and 2019. DataViz 2 shows the LFPR of 2009 and 2019 across age-bands. DataViz 3 show the cohort size of each age band, and how population cohorts move across age-bands. Lastly, DataViz 4 shows the cumulative total of RLF in percentage. By plotting the 50-percentile reference line, it shows the increase in median age in 2019.\r\nThe proposed data visualization is designed using Tableau and can be found here\r\n4.0 Data Visualization Preparation\r\n4.1 Data Preparation\r\nFor DataViz 1, 3 and 4\r\nThe dataset used is from Table 7 RESIDENT LABOUR FORCE AGED FIFTEEN YEARS AND OVER BY AGE AND SEX, 2009 - 2019 (JUNE), the excel sheet in Tab – T7_T. The data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx.\r\nIn this excel sheet, column E and Z correspond to the data in Year 2009 and 2019. The remaining columns are removed as they are not required. Row 6 shows the total resident labour force for each year, and deleted, since Tableau has calculated field functions to generate the required data.\r\n\r\n\r\n\r\nThe revised datasheet is imported into Tableau for further data visualization preparation. The categorical variable – Age(Years) occupies 3 columns (A,B,C) and hence Column A and B contains null values. These 3 columns are selected and “Merge Mismatch Fields” is selected. The column is renamed to “Age (Years)”. All 3 variables and their respective data types are mapped accurately by Tableau.\r\n\r\n\r\n\r\nFor DataViz 2\r\nThe dataset used is from Table 5 RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE), the excel sheet in Tab – T5_T. The data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx.\r\nIn this excel sheet, column E and Z correspond to the data in Year 2009 and 2019. The remaining columns are removed as they are not required. Row 6 and row 19 onwards are deleted as well.\r\n\r\n\r\n\r\nThe column 2009 and 2019 are renamed to 2009 (%) and 2019 (%) All 3 variables and their respective data types are mapped accurately by Tableau.\r\n\r\n\r\n\r\n4.2 Data Visualization Preparation\r\nData Visualization 1 - Percentage Share of Labour Force By Age Band\r\nCreating new calculated field\r\nTo find percentage share of RLF for each age band, 2 new calculated fields are created.\r\n\r\n\r\n\r\nGrouping of Dimensions\r\nInstead of showing 12 age-bands, the age-bands will be collapsed only 3 age-bands by using the grouping function.The final age-bands are 15 to 24, 25 to 54 and 55 and above. The new dimension is re-labeled as Age Band (Years), the 3 age bands are renamed and re-colored into 3 distinct colors.\r\n\r\n\r\n\r\n\r\n\r\n\r\nFinal Layout\r\nThe visualization is given a proper header and the y-axis is fixed with the range 0% to 100%. The y-axis is also renamed as “Share of Resident (%)” The values are labeled by selecting “Show Mark labels” to provide readers more clarity on the values.\r\n\r\n\r\n\r\nData Visualization 2 - Labour Force Participant Rate by Age Band\r\nCreating a line graph\r\n[Age (Years)] are placed at the columns whereas [Measure Values], which include summation of LFPR in 2009 and 2019 are placed in the rows. 2009 is represented by blue whereas 2019 is represented by red. The marks are changed to line graph. The visualization is given a proper header. The y-axis is also renamed as “Labour Force Participation Rate (%)”\r\n\r\n\r\n\r\n\r\n\r\n\r\nData Visualization 3 - Cumulative Total of Resident Labour Force by Age\r\nCreating new calculated field\r\nTo find the cumulative total of residents in 2009 and 2019, 2 calculated fields are created using the following equation RUNNING_SUM(SUM([2009])) / TOTAL(SUM([2009]))\r\n\r\n\r\n\r\nFinal Layout\r\nThe 2 new fields are renamed as % of Cumulative Total 2009 and 2019 respectively. The 2 measure values are selected into the rows of the visualization, with 2009 represented by blue and 2019 represented by red. The mark is changed to line to show the gradient of the cumulative total.The visualization is given a proper header and the y-axis is fixed with the range 0% to 100%. The y-axis is also renamed as “Cumulative Total of Resident(%)”\r\n\r\n\r\n\r\nAdding Reference Line and Annotation\r\nTo show the median age of labour force in 2009 and 2019, a reference line at the 50 percentile is added. As the x-axis consists of age-band instead of age, annotations are included to provide more clarity\r\n\r\n\r\n\r\nData Visualization 4 - Resident Labour Force by Age\r\nCreating a Histogram\r\n[Age (Years)] and [Measure Names] are placed at the columns whereas [Measure Values], which include summation of number of residents in 2009 and 2019 are placed in the rows. Keeping the colors consistent, 2009 is represented by blue whereas 2019 is represented by red. The marks are changed to bar for easier comparison between age bands\r\n\r\n\r\n\r\nFinal Layout\r\nThe visualization is given a proper header. The y-axis is also renamed as “Number of Residents (‘000)”. Only the bars with a significant difference in values are being marked to avoid cluttering\r\n\r\n\r\n\r\n5.0 Major Observations\r\n1. Increase in labour force for aged 45-49\r\nBased on Visualization 3, in 2009, residents aged 35-39 have the most number of residents in labour force whereas in 2019, residents aged 45-49. This is the same population cohort that moved across age-band after 10 years. Interesting, this cohort increases in size as well as RLPR (based on Visualization 2), suggesting either an increase in new working residents or an increase of residents re-entering workforce or both.\r\n2. Baby boomers - Spike in population aged 55 and above\r\nThere is a substantial increase in residents in labour force above age 55 due to 2 reasons:\r\nIncrease in RLFR as compared to 2009 as supported by 2nd visualization\r\nSpike in population, with baby boomers born between 1947 to 1964 who are aged 55 and above in 2019.\r\n3. Entering workforce at a later age\r\nIn 2009, the population cohort of 25-29 has the highest RLPR whereas in 2019, the population cohort of 30-34 has the highest RLPR instead. This implies that the average age to enter workforce in Singapore has increased, probably due to additional years of education.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T00:06:41+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to VIZ",
    "description": "Welcome to our new blog, VIZ. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Mei Siew Toh",
        "url": "https://www.linkedin.com/in/mei-siew-toh/"
      }
    ],
    "date": "2021-01-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-07T22:56:34+08:00",
    "input_file": {}
  }
]
